export default () => {
  return (
    <div>
      <ul>
        <br />
        <li className="text-2xl font-bold">利用規約</li>
        <br />
      </ul>
      <div>
        <p>
          この利用規約（以下，「本規約」といいます。）は，YoutubeGptがこのウェブサイト上で提供するサービスの利用条件を定めるものです。登録ユーザーの皆さま（以下，「ユーザー」といいます。）には，本規約に従って，本サービスをご利用いただきます。
        </p>
        <h2 className="mt-5 mb-5 text-xl font-bold">第1条（サービスの説明）</h2>
        <p>
          当社は、YouTube動画を要約するサービスを提供します。本サービスは、ユーザーが要約できる動画数に異なるクォータを持つ、様々な有料のプランを提供します。無料ユーザーは５個の動画要約をプレビューすることができるが、5個以上の要約のロックを解除するには有料プランにアップグレードする必要がある。
        </p>
        <br />
        <h2 className="mt-5 mb-5 text-xl font-bold">第2条（個人情報の収集と使用）</h2>
        <br />
        <p>
          本サービスに登録する際、OAuthプロセスを通じてフルネームとEメールアドレスを入力するよう求められます。YoutubeGptは、この情報を収集し、本サービスにログインする際に使用するアカウントに保存します。本サービスを利用することにより、本規約およびプライバシーポリシーに記載されているYouTubeGptによる個人情報の収集および使用に同意したものとみなされます。
        </p>
        <br />
        <h2 className="mt-5 mb-5 text-xl font-bold">第3条（利用の制限）</h2>
        <br />
        <p>
          お客様は、合法的な目的でのみ本サービスを利用することができます。本サービスを使用して要約をスクレイピングすることはできません。お客様は、本サービスに損害を与え、これを使用不能にし、これに過度の負担をかけ、もしくはこれを害するような方法、または他者による本サービスの使用および享受を妨害するような方法で、本サービスを使用することはできません。
        </p>
        <p></p>
        <br />
        <h2 className="mt-5 mb-5 text-xl font-bold">第4条（免責）</h2>
        <br />
        <p>
          お客様はご自身の責任において本サービスをご利用ください。適用される法律が許容する最大限の範囲において、お客様はここに、商品性、特定目的への適合性、および非侵害の黙示的保証を含むがこれに限定されない、すべての保証を放棄します。お客様は、本サービスによって生成される要約が100%正確であることを保証できないことを了承するものとします。
        </p>
        <p></p>
        <br />
        <h2 className="mt-5 mb-5 text-xl font-bold">第5条（責任の制限）</h2>
        <br />
        <p>
          お客様は、適用法令により認められる最大限の範囲において、本サービスの利用に起因または関連して生じた一切の損害(間接損害、付随的損害、特別損害または派生的損害を含みますが、これらに限定されません)について、YouTubeGptまたはその関連会社に責任を問わないことに同意するものとします。
        </p>
        <br />
        <h2 className="mt-5 mb-5 text-xl font-bold">第6条（本サイトの一時的な停止、変更または廃止）</h2>
        <br />
        <p>
          1.当社は、以下の事由に該当すると判断した場合には、事前の通知や承諾なしに、本サイトの一時的な中断を行うことがあります。
        </p>
        <p>（１） システムの保守または変更を行う場合。</p>
        <p>（２） 天災事変その他非常事態が発生し、または発生するおそれがあり、本サイトの運営が困難な場合。</p>
        <p>（３） その他当社が必要やむをえないと認めた場合。</p>
        <p>2.本サイトの情報、URLは、予告なしに変更または廃止される場合があります。</p>
        <p></p>
        <br />
        <h2 className="mt-5 mb-5 text-xl font-bold">第7条（一般規約）</h2>
        <br />
        <p>
          本規約は、お客様とYouTubeGptとの間の完全な合意を構成し、お客様の本サービスの使用を規定します。本規約のいずれかの条項が無効であると判断された場合でも、本規約の残りの条項は引き続き完全な効力を有することに両当事者は同意するものとします。本利用規約の準拠法は日本法とし、本サイトおよび本利用規約に関する一切の紛争は、東京地方裁判所を第一審の専属的合意管轄裁判所とします。
        </p>
        <br />
        <h2 className="mt-5 mb-5 text-xl font-bold">第8条（利用規約の変更）</h2>
        <br />
        <p>
          YouTubeGptは、本規約を随時変更することができます。本規約に重大な変更を加える場合は、本サービスを通じて、またはその他の方法でお客様に通知します。このような変更後も本サービスの利用を継続する場合、お客様は新しい規約に同意したものとみなされます。変更に同意しない場合は、本サービスの利用を中止してください。
        </p>
        <br />
        <p>最終更新日 2023-08-19.</p>
      </div>
    </div>
  )
}
